import React from 'react';

// не смог найти api, где у пользователей есть описание
// поэтому взял из задания
const desc1 = `Клиенты видят в нем эксперта по вопросам разработки комплексных решений финансовых продуктов, включая такие аспекты, как организационная структура, процессы, аналитика и ИТ-компоненты. Он помогает клиентам лучше понимать структуру рисков их бизнеса, улучшать процессы за счет применения новейших технологий и увеличивать продажи, используя самые современные аналитические инструменты.`;

const desc2 = `В работе с клиентами недостаточно просто решить конкретную проблему или помочь справиться с трудностями. Не менее важно уделять внимание обмену знаниями: Один из самых позитивных моментов — это осознание того, что ты помог клиенту перейти на совершенно новый уровень компетентности, уверенность в том, что после окончания проекта у клиента есть все необходимое, чтобы дальше развиваться самостоятельно.`;

const desc3 = `Помимо разнообразных проектов для клиентов финансового сектора, Сорин ведет активную предпринимательскую деятельность. Он является совладельцем сети клиник эстетической медицины в Швейцарии, предлагающей инновационный подход к красоте, а также инвестором других бизнес-проектов.`;

export const UserDescription = React.memo(() => {
  return (
    <div className="w-[630px] text-justify text-[16px] text-black">
      <div className="pb-4">{desc1}</div>
      <div className="pb-4">{desc2}</div>
      <div className="pb-4">{desc3}</div>
    </div>
  );
});
